/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   free_memory.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bhugo <bhugo@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/11 20:27:00 by bhugo             #+#    #+#             */
/*   Updated: 2019/12/11 20:46:18 by bhugo            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_print.h"

/*
** вспомогательная функция для отчистки
** если malloc вернет NULL
*/

int	free_memory(char **s)
{
	free(*s);
	exit(-1);
}
